# -*- coding: UTF-8 -*-
import hashlib
import json
import os
import urllib

import cv2
import numpy as np
from PIL import Image

base_info = {
    "150": {
        "hero": "Gnar",
        "skins": {
            "1": "最后一只恐龙 纳尔",
            "0": "迷失之牙 纳尔",
            "2": "萌侦探 喵尔摩斯",
            "3": "冰雪兽 纳尔",
            "4": "狂狮 纳尔",
            "13": "银河魔装机神 纳尔",
            "14": "SSG 纳尔"
        }
    },
    "497": {
        "hero": "Rakan",
        "skins": {
            "1": "晨星之翎 洛",
            "0": "幻翎 洛",
            "2": "甜心之翎 洛",
            "3": "SSG 洛"
        }
    },
    "163": {
        "hero": "Taliyah",
        "skins": {
            "1": "弗雷尔卓德 塔莉垭",
            "0": "岩雀 塔莉垭",
            "2": "SSG 塔莉垭"
        }
    },
    "122": {
        "hero": "Darius",
        "skins": {
            "1": "铁血帝皇 德莱厄斯",
            "0": "德莱厄斯 德莱厄斯",
            "3": "勇敢的心 德莱厄斯",
            "2": "生化骑士 德莱厄斯",
            "8": "热血班长 德莱厄斯",
            "14": "恐惧新星 德莱厄斯",
            "15": "神王 德莱厄斯",
            "4": "灌篮高手 德莱厄斯"
        }
    },
    "133": {
        "hero": "Quinn",
        "skins": {
            "1": "血羽凤凰 奎因",
            "0": "奎因 奎因",
            "3": "死亡之鹰 奎因",
            "2": "勇敢的心 奎因",
            "4": "觅心之翼 奎因"
        }
    },
    "432": {
        "hero": "Bard",
        "skins": {
            "1": "巴德 巴德",
            "0": "长者之森 巴德",
            "5": "冰雪游神 巴德",
            "6": "吟游诗人 巴德"
        }
    },
    "223": {
        "hero": "TahmKench",
        "skins": {
            "0": "河流之王 塔姆",
            "1": "五星大厨 塔姆",
            "2": "海牛大大 塔姆"
        }
    },
    "131": {
        "hero": "Diana",
        "skins": {
            "1": "暗黑女武神 黛安娜",
            "0": "黛安娜 黛安娜",
            "3": "无限烈焰 黛安娜",
            "2": "广寒仙子 嫦娥",
            "11": "腥红之月 黛安娜"
        }
    },
    "134": {
        "hero": "Syndra",
        "skins": {
            "1": "仲裁圣女 辛德拉",
            "0": "辛德拉 辛德拉",
            "3": "方块王后 辛德拉",
            "2": "亚特兰蒂斯 辛德拉",
            "4": "冰雪女神 辛德拉"
        }
    },
    "245": {
        "hero": "Ekko",
        "skins": {
            "0": "时间刺客 艾克",
            "1": "时之砂 艾克",
            "2": "任性学霸 艾克",
            "3": "源计划 艾克",
            "11": "T1 艾克"
        }
    },
    "136": {
        "hero": "AurelionSol",
        "skins": {
            "0": "铸星龙王 奥瑞利安·索尔",
            "1": "灰烬领主 奥瑞利安·索尔"
        }
    },
    "498": {
        "hero": "Xayah",
        "skins": {
            "0": "逆羽 霞",
            "1": "暮星之羽 霞"
        }
    },
    "24": {
        "hero": "Jax",
        "skins": {
            "13": "武神 贾克斯",
            "12": "光明骑士 贾克斯",
            "1": "冰球队员 贾克斯",
            "0": "贾克斯 贾克斯",
            "3": "宗师级钓鱼训练师 贾克斯",
            "2": "万夫莫开 贾克斯",
            "5": "百夫长 贾克斯",
            "4": "卧虎藏龙 贾克斯",
            "7": "复仇武神 贾克斯",
            "6": "少林武僧 贾克斯",
            "8": "SKT T1 贾克斯"
        }
    },
    "25": {
        "hero": "Morgana",
        "skins": {
            "11": "魅惑女巫 莫甘娜",
            "10": "紫金罗刹 莫甘娜",
            "1": "杀戮天使昔拉 莫甘娜",
            "0": "莫甘娜 莫甘娜",
            "3": "刀锋女王 莫甘娜",
            "2": "地狱厨房 莫甘娜",
            "5": "鬼魂新娘 莫甘娜",
            "4": "黑色荆棘 莫甘娜",
            "6": "胜利女神 莫甘娜"
        }
    },
    "26": {
        "hero": "Zilean",
        "skins": {
            "1": "圣诞狂欢 基兰",
            "0": "基兰 基兰",
            "3": "遗迹守护者 基兰",
            "2": "嘻哈精神 基兰",
            "5": "腥红之月 基兰",
            "4": "时间机器 基兰"
        }
    },
    "145": {
        "hero": "Kaisa",
        "skins": {
            "0": "虚空之女 卡莎",
            "1": "弹幕天使 卡莎"
        }
    },
    "202": {
        "hero": "Jhin",
        "skins": {
            "0": "戏命师 烬",
            "1": "西部牛仔 烬",
            "2": "猩红之月 烬",
            "3": "SKT 烬",
            "4": "源计划 烬"
        }
    },
    "203": {
        "hero": "Kindred",
        "skins": {
            "0": "永猎双子 千钰",
            "1": "黯焰双魂 千钰",
            "2": "银河魔装机神 千钰"
        }
    },
    "27": {
        "hero": "Singed",
        "skins": {
            "1": "防暴士兵 辛吉德",
            "0": "辛吉德 辛吉德",
            "3": "冲浪高手 辛吉德",
            "2": "机械污染 辛吉德",
            "5": "炼金狂士 辛吉德",
            "4": "科学狂人 辛吉德",
            "7": "SSW 辛吉德",
            "6": "冰雪节 辛吉德",
            "9": "养蜂人 辛吉德",
            "8": "黑色天灾 辛吉德"
        }
    },
    "141": {
        "hero": "Kayn",
        "skins": {
            "0": "影流之镰 凯隐",
            "1": "摄魂猎手 凯隐",
            "2": "他们说这是 凯隐",
            "3": "这个也说是 凯隐"
        }
    },
    "427": {
        "hero": "Ivern",
        "skins": {
            "0": "翠神 艾翁",
            "1": "糖果之王 艾翁"
        }
    },
    "164": {
        "hero": "Camille",
        "skins": {
            "0": "青钢硬 卡蜜尔",
            "1": "源代码 卡米尔"
        }
    },
    "516": {
        "hero": "Ornn",
        "skins": {
            "0": "山隐之焰 奥恩",
            "1": "雷霆领主 奥恩"
        }
    },
    "240": {
        "hero": "Kled",
        "skins": {
            "0": "暴烈骑士 克烈",
            "1": "爵士 克烈"
        }
    },
    "420": {
        "hero": "Illaoi",
        "skins": {
            "0": "海兽祭司 俄洛伊",
            "1": "虚空使者 俄洛伊",
            "2": "抵抗军炎魔 俄洛伊"
        }
    },
    "20": {
        "hero": "Nunu",
        "skins": {
            "0": "努努 努努",
            "3": "脏兮兮 努努",
            "2": "圣诞狂欢 努努",
            "5": "攻城巨兽 努努",
            "4": "合金巨兽 努努",
            "7": "丧尸 努努",
            "6": "暗杀星 努努"
        }
    },
    "21": {
        "hero": "MissFortune",
        "skins": {
            "15": "星之守护者 厄运小姐",
            "16": "武装战姬 厄运小姐",
            "1": "西部牛仔 厄运小姐",
            "0": "厄运小姐 厄运小姐",
            "3": "特工狂花 厄运小姐",
            "2": "法国皇室 厄运小姐",
            "5": "荒野女警 厄运小姐",
            "4": "圣诞糖果棒 厄运小姐",
            "7": "电玩女神 厄运小姐",
            "6": "黑帮狂花 厄运小姐",
            "9": "泳池派对 厄运小姐",
            "8": "女帝 厄运小姐"
        }
    },
    "22": {
        "hero": "Ashe",
        "skins": {
            "1": "极地女神 艾希",
            "0": "艾希 艾希",
            "3": "勇敢的心 艾希",
            "2": "丛林侠盗 艾希",
            "5": "紫晶射手 艾希",
            "4": "女皇 艾希",
            "7": "黑暗骑士 艾希",
            "6": "觅心女王 艾希",
            "9": "冠军之箭 艾希",
            "8": "源计划：联合 艾希"
        }
    },
    "23": {
        "hero": "Tryndamere",
        "skins": {
            "1": "勇敢的心 泰达米尔",
            "0": "泰达米尔 泰达米尔",
            "3": "诸神的黄昏 泰达米尔",
            "2": "国王 泰达米尔",
            "5": "奥斯曼大帝 泰达米尔",
            "4": "恶魔之刃 泰达米尔",
            "7": "梦魇 泰达米尔",
            "6": "关羽 云长",
            "9": "生化领主 泰达米尔",
            "8": "野兽猎人 泰达米尔"
        }
    },
    "28": {
        "hero": "Evelynn",
        "skins": {
            "1": "黑暗女王 伊芙琳",
            "0": "伊芙琳 伊芙琳",
            "3": "探戈灵魂 伊芙琳",
            "2": "假面女皇 伊芙琳",
            "4": "惊天魔盗 伊芙琳"
        }
    },
    "29": {
        "hero": "Twitch",
        "skins": {
            "1": "首领 图奇",
            "0": "图奇 图奇",
            "3": "都铎王朝 图奇",
            "2": "北风冻原 图奇",
            "5": "横行霸道 图奇",
            "4": "黑金诱惑 图奇",
            "7": "SSW 图奇",
            "6": "绝影神偷 图奇",
            "8": "欧米伽小队 图奇"
        }
    },
    "161": {
        "hero": "Velkoz",
        "skins": {
            "1": "战地机甲 维克兹",
            "0": "维克兹 维克兹",
            "3": "这货不是维克兹 维克兹",
            "2": "苍穹之光 维克兹"
        }
    },
    "4": {
        "hero": "TwistedFate",
        "skins": {
            "10": "腥红之月 崔斯特",
            "1": "蓝色忧郁 崔斯特",
            "0": "崔斯特 崔斯特",
            "3": "魔幻卡牌 崔斯特",
            "2": "红桃杰克 崔斯特",
            "5": "西部牛仔 崔斯特",
            "4": "探戈灵魂 崔斯特",
            "7": "地底世界 崔斯特",
            "6": "皇家火枪手 崔斯特",
            "9": "逍遥赌侠 崔斯特",
            "8": "逆转裁判 崔斯特"
        }
    },
    "8": {
        "hero": "Vladimir",
        "skins": {
            "1": "弗拉基米尔伯爵 弗拉基米尔",
            "0": "弗拉基米尔 弗拉基米尔",
            "3": "诺斯费拉图  弗拉基米尔",
            "2": "弗拉基米尔侯爵 弗拉基米尔",
            "5": "鲜血领主 弗拉基米尔",
            "4": "霹雳游侠 弗拉基米尔",
            "7": "学生会长 弗拉基米尔",
            "6": "摄魂男爵 弗拉基米尔"
        }
    },
    "120": {
        "hero": "Hecarim",
        "skins": {
            "1": "血色骑士 赫卡里姆",
            "0": "赫卡里姆 赫卡里姆",
            "3": "无头骑士 赫卡里姆",
            "2": "幽魂骑士 赫卡里姆",
            "5": "长者之森 赫卡里姆",
            "4": "电玩战魂 赫卡里姆",
            "7": "零之枪骑 赫卡里姆",
            "6": "灭世魔神 赫卡里姆"
        }
    },
    "121": {
        "hero": "Khazix",
        "skins": {
            "1": "霸天异形 卡兹克",
            "0": "卡兹克 卡兹克",
            "3": "死亡绽放 卡兹克",
            "2": "圣金甲虫 卡兹克",
            "4": "死兆星 卡兹克"
        }
    },
    "267": {
        "hero": "Nami",
        "skins": {
            "1": "锦鲤 娜美",
            "0": "娜美 娜美",
            "3": "鲛妮座人 娜美",
            "2": "河水之灵 娜美",
            "7": "海皇姬 娜美"
        }
    },
    "266": {
        "hero": "Aatrox",
        "skins": {
            "1": "仲裁圣骑 亚托克斯",
            "0": "亚托克斯 亚托克斯",
            "3": "狂鲨 亚托克斯",
            "2": "霸天剑魔 亚托克斯"
        }
    },
    "126": {
        "hero": "Jayce",
        "skins": {
            "1": "全金属狂潮 杰斯",
            "0": "杰斯 杰斯",
            "3": "天启骑士 杰斯",
            "2": "蔷薇绅士 杰斯",
            "4": "杰斯·光明之锤 杰斯"
        }
    },
    "127": {
        "hero": "Lissandra",
        "skins": {
            "1": "血石妖后 丽桑卓",
            "0": "丽桑卓 丽桑卓",
            "3": "源代码 丽桑卓",
            "2": "刀锋女王 丽桑卓"
        }
    },
    "268": {
        "hero": "Azir",
        "skins": {
            "1": "星际之门 阿兹尔",
            "0": "阿兹尔 阿兹尔",
            "3": "SKT T1 阿兹尔",
            "2": "幽冥领主 阿兹尔",
            "4": "司马懿 仲达"
        }
    },
    "59": {
        "hero": "JarvanIV",
        "skins": {
            "1": "孤胆英豪 嘉文四世",
            "0": "嘉文四世 嘉文四世",
            "3": "龙骑统帅 嘉文四世",
            "2": "屠龙勇士 嘉文四世",
            "5": "吕布 奉先",
            "4": "凯旋英雄 嘉文四世",
            "7": "死兆星 嘉文四世",
            "6": "Fnatic 嘉文四世"
        }
    },
    "58": {
        "hero": "Renekton",
        "skins": {
            "1": "星河战队 雷克顿",
            "0": "雷克顿 雷克顿",
            "3": "血色暴君 雷克顿",
            "2": "荒野之咬 雷克顿",
            "5": "枯萎之壤 雷克顿",
            "4": "符文战神 雷克顿",
            "7": "猛龙 雷克顿",
            "6": "泳池派对 雷克顿",
            "9": "鳄霸 雷克顿",
            "8": "SKT T1 雷克顿"
        }
    },
    "55": {
        "hero": "Katarina",
        "skins": {
            "10": "死亡誓约 卡特琳娜",
            "1": "赏金猎人 卡特琳娜",
            "0": "卡特琳娜 卡特琳娜",
            "3": "海贼魅影 卡特琳娜",
            "2": "红牌！退场！ 卡特琳娜",
            "5": "前线指挥官 卡特琳娜",
            "4": "暗夜猫女 卡特琳娜",
            "7": "夺命美人 卡特琳娜",
            "6": "沙漠风暴 卡特琳娜",
            "9": "源计划：雄心 卡特琳娜",
            "8": "闭月之颜 貂蝉"
        }
    },
    "54": {
        "hero": "Malphite",
        "skins": {
            "1": "三叶草 墨菲特",
            "0": "墨菲特 墨菲特",
            "3": "石破天惊 墨菲特",
            "2": "珊瑚礁 墨菲特",
            "5": "冰川巨兽 墨菲特",
            "4": "黑曜石守护者 墨菲特",
            "7": "无畏号 墨菲特",
            "6": "霸天巨兽 墨菲特"
        }
    },
    "57": {
        "hero": "Maokai",
        "skins": {
            "1": "烈焰古树 茂凯",
            "0": "茂凯 茂凯",
            "3": "喜庆之树 茂凯",
            "2": "图腾古树 茂凯",
            "5": "绿茵门神 茂凯",
            "4": "鬼影森森 茂凯",
            "7": "胜利之树 茂凯",
            "6": "喵凯 茂凯"
        }
    },
    "56": {
        "hero": "Nocturne",
        "skins": {
            "1": "蓝焰梦魔 魔腾",
            "0": "魔腾 魔腾",
            "3": "劫掠梦魇 魔腾",
            "2": "幻影梦魔 魔腾",
            "5": "上古战魂 魔腾",
            "4": "鬼影重重 魔腾",
            "6": "恶咒亡魂 魔腾"
        }
    },
    "51": {
        "hero": "Caitlyn",
        "skins": {
            "11": "未来战士 凯特琳",
            "10": "玉净夜叉 凯特琳",
            "1": "抵抗军天使 凯特琳",
            "0": "凯特琳 凯特琳",
            "3": "古墓丽影 凯特琳",
            "2": "荒野治安官 凯特琳",
            "5": "女警狙击 凯特琳",
            "4": "冰原狙击 凯特琳",
            "6": "铁血狙击手 凯特琳"
        }
    },
    "50": {
        "hero": "Swain",
        "skins": {
            "1": "北领前线 斯维因",
            "0": "斯维因 斯维因",
            "3": "绝代智将 斯维因",
            "2": "海贼参谋 斯维因",
            "4": "驯龙大师 斯维因"
        }
    },
    "53": {
        "hero": "Blitzcrank",
        "skins": {
            "11": "战场BOSS 布里茨",
            "20": "暮色枪骑 布里茨",
            "21": "银白枪骑 布里茨",
            "1": "铁锈斑斑 布里茨",
            "0": "布里茨 布里茨",
            "3": "擂台皇帝 布里茨",
            "2": "钢铁之门 布里茨",
            "5": "戴一个表 布里茨",
            "4": "陆地王者4WD 布里茨",
            "7": "防暴机器人 布里茨",
            "6": "苹果机器人 布里茨"
        }
    },
    "412": {
        "hero": "Thresh",
        "skins": {
            "1": "深渊恐惧 锤石",
            "0": "锤石 锤石",
            "3": "腥红之月 锤石",
            "2": "冠军典狱长 锤石",
            "5": "死兆星 锤石",
            "4": "SSW 锤石"
        }
    },
    "115": {
        "hero": "Ziggs",
        "skins": {
            "1": "科学狂人 吉格斯",
            "0": "吉格斯 吉格斯",
            "3": "泳池派对 吉格斯",
            "2": "少校 吉格斯",
            "5": "奥术大师 吉格斯",
            "4": "雪球也能爆炸！ 吉格斯",
            "6": "战场BOSS 吉格斯"
        }
    },
    "142": {
        "hero": "Zoe",
        "skins": {
            "0": "目光星灵 佐伊",
            "1": "赛博潮流 佐伊",
            "2": "泳池派对 佐伊"
        }
    },
    "114": {
        "hero": "Fiora",
        "skins": {
            "22": "玉剑传说 无双",
            "1": "皇家守卫 菲奥娜",
            "0": "菲奥娜 菲奥娜",
            "3": "女校长 菲奥娜",
            "2": "夜鸦 菲奥娜",
            "5": "泳池派对 菲奥娜",
            "4": "源计划：火 菲奥娜"
        }
    },
    "117": {
        "hero": "Lulu",
        "skins": {
            "0": "璐璐 璐璐",
            "3": "驯龙女巫 璐璐",
            "2": "邪恶女巫 璐璐",
            "5": "泳池派对 璐璐",
            "4": "寒冬精灵 璐璐",
            "6": "星之守护者 璐璐"
        }
    },
    "89": {
        "hero": "Leona",
        "skins": {
            "1": "瓦尔基里 蕾欧娜",
            "0": "蕾欧娜 蕾欧娜",
            "3": "钢铁烈阳 蕾欧娜",
            "2": "神圣守卫 蕾欧娜",
            "4": "泳池派对 蕾欧娜",
            "9": "烧烤女神 蕾欧娜",
            "8": "源计划：山 蕾欧娜"
        }
    },
    "111": {
        "hero": "Nautilus",
        "skins": {
            "1": "失落大陆 诺提勒斯",
            "0": "韦鲁斯 韦鲁斯",
            "3": "宇航员 诺提勒斯",
            "2": "地底迷城 诺提勒斯",
            "5": "灭世魔神 诺提勒斯",
            "4": "光明骑士 诺提勒斯"
        }
    },
    "110": {
        "hero": "Varus",
        "skins": {
            "1": "夜魔水晶 韦鲁斯",
            "0": "韦鲁斯 韦鲁斯",
            "3": "白色死神 韦鲁斯",
            "2": "苍穹之光 韦鲁斯",
            "5": "韦鲁斯·迅箭 韦鲁斯",
            "4": "觅心射手 韦鲁斯",
            "6": "死兆星 韦鲁斯"
        }
    },
    "113": {
        "hero": "Sejuani",
        "skins": {
            "1": "野兽女王 瑟庄妮",
            "0": "瑟庄妮 瑟庄妮",
            "3": "传统造型 瑟庄妮",
            "2": "死亡骑士 瑟庄妮",
            "5": "魄罗骑士 瑟庄妮",
            "4": "战熊骑士 瑟庄妮",
            "7": "瑟庄妮·逐晓者 瑟庄妮",
            "6": "野兽猎人 瑟庄妮"
        }
    },
    "112": {
        "hero": "Viktor",
        "skins": {
            "1": "全金属狂潮 维克托",
            "0": "维克托 维克托",
            "3": "造物主 维克托",
            "2": "初号机 维克托",
            "4": "死亡誓约 维克托"
        }
    },
    "82": {
        "hero": "Mordekaiser",
        "skins": {
            "1": "龙骑士 莫德凯撒",
            "0": "莫德凯撒 莫德凯撒",
            "3": "五杀摇滚吉他手  莫德凯撒",
            "2": "地狱火 莫德凯撒",
            "5": "梅花国王 莫德凯撒",
            "4": "死亡领主 莫德凯撒"
        }
    },
    "83": {
        "hero": "Yorick",
        "skins": {
            "1": "地狱送葬 约里克",
            "0": "约里克 约里克",
            "3": "苍穹之光 约里克",
            "2": "五杀摇滚贝斯手 约里克"
        }
    },
    "80": {
        "hero": "Pantheon",
        "skins": {
            "1": "斯巴达之魂 潘森",
            "0": "潘森 潘森",
            "3": "英仙座珀尔修斯 潘森",
            "2": "万人敌 潘森",
            "5": "大夏武士 潘森",
            "4": "钢铁意志 潘森",
            "7": "丧尸杀手 潘森",
            "6": "屠龙勇士 潘森",
            "8": "面包之王 潘森"
        }
    },
    "81": {
        "hero": "Ezreal",
        "skins": {
            "18": "星之守护者 伊泽瑞尔",
            "1": "冒险精神 伊泽瑞尔",
            "0": "伊泽瑞尔 伊泽瑞尔",
            "3": "冰川勇者 伊泽瑞尔",
            "2": "足球先生 伊泽瑞尔",
            "5": "未来战士 伊泽瑞尔",
            "4": "失落的世界 伊泽瑞尔",
            "7": "光执事 伊泽瑞尔",
            "6": "暗杀星 伊泽瑞尔",
            "9": "电玩勇者 伊泽瑞尔",
            "8": "黑桃皇牌 伊泽瑞尔"
        }
    },
    "86": {
        "hero": "Garen",
        "skins": {
            "11": "张辽 文远",
            "10": "暴君 盖伦",
            "13": "神王 盖伦",
            "1": "战神阿瑞斯 盖伦",
            "0": "盖伦 盖伦",
            "3": "铁甲雄心 盖伦",
            "2": "黄金骑士 盖伦",
            "5": "孤高游侠 盖伦",
            "4": "死亡骑士 盖伦",
            "6": "钢铁军团 盖伦"
        }
    },
    "84": {
        "hero": "Akali",
        "skins": {
            "1": "蜂刺 阿卡丽",
            "0": "阿卡丽 阿卡丽",
            "3": "足球宝贝 阿卡丽",
            "2": "绯红 阿卡丽",
            "5": "腥红之月 鬼武姬 阿卡丽",
            "4": "实习护士 阿卡丽",
            "7": "铁血女忍 阿卡丽",
            "6": "银色之牙 阿卡丽",
            "8": "刺身之拳 阿卡丽"
        }
    },
    "85": {
        "hero": "Kennen",
        "skins": {
            "1": "红色彗星 凯南",
            "0": "凯南 凯南",
            "3": "空手道 凯南",
            "2": "银色闪电 凯南",
            "5": "刺客信条 凯南",
            "4": "医学博士 凯南",
            "7": "超级英雄 凯南",
            "6": "腥红之月 凯南"
        }
    },
    "429": {
        "hero": "Kalista",
        "skins": {
            "1": "腥红之月 卡莉丝塔",
            "0": "卡莉丝塔 卡莉丝塔",
            "3": "SKT T1 卡莉丝塔",
            "2": "冠军之矛 卡莉丝塔"
        }
    },
    "3": {
        "hero": "Galio",
        "skins": {
            "1": "幽蓝梦魇 加里奥",
            "0": "加里奥 加里奥",
            "3": "战地之王 加里奥",
            "2": "机械迷城 加里奥",
            "5": "风执事 加里奥",
            "4": "地狱之门卫士 加里奥",
            "6": "鸡里奥 加里奥"
        }
    },
    "7": {
        "hero": "Leblanc",
        "skins": {
            "1": "潮流女王 乐芙兰",
            "0": "乐芙兰 乐芙兰",
            "3": "幸福女神 乐芙兰",
            "2": "社会名流 乐芙兰",
            "5": "长者之森 乐芙兰",
            "4": "邪鸦魅影 乐芙兰"
        }
    },
    "421": {
        "hero": "RekSai",
        "skins": {
            "1": "上古战魂 雷克塞",
            "0": "雷克塞 雷克塞",
            "2": "泳池派对 雷克塞"
        }
    },
    "102": {
        "hero": "Shyvana",
        "skins": {
            "1": "钢之逆鳞 希瓦娜",
            "0": "希瓦娜 希瓦娜",
            "3": "黯黑魔龙 希瓦娜",
            "2": "骸骨之爪 希瓦娜",
            "5": "冠军之血 希瓦娜",
            "4": "冰霜亚龙 希瓦娜",
            "6": "银河魔装机神 希瓦娜"
        }
    },
    "103": {
        "hero": "Ahri",
        "skins": {
            "14": "星之守护者 阿狸",
            "1": "高丽风情 阿狸",
            "0": "阿狸 阿狸",
            "3": "焰尾妖狐 阿狸",
            "2": "暗影妖狐 阿狸",
            "5": "勇者 阿狸",
            "4": "偶像歌手 阿狸",
            "7": "电玩女神 阿狸",
            "6": "风纪委员 阿狸"
        }
    },
    "101": {
        "hero": "Xerath",
        "skins": {
            "1": "符文生物 泽拉斯",
            "0": "泽拉斯 泽拉斯",
            "3": "枯萎之壤 泽拉斯",
            "2": "战地法师 泽拉斯",
            "4": "圣金巫灵 泽拉斯"
        }
    },
    "106": {
        "hero": "Volibear",
        "skins": {
            "1": "雷霆领主 沃利贝尔",
            "0": "沃利贝尔 沃利贝尔",
            "3": "符文战熊 沃利贝尔",
            "2": "北地风暴 沃利贝尔",
            "5": "怒熊 沃利贝尔",
            "4": "警长 沃利贝尔"
        }
    },
    "107": {
        "hero": "Rengar",
        "skins": {
            "1": "铁血猎人 雷恩加尔",
            "0": "雷恩加尔 雷恩加尔",
            "3": "SSW 雷恩加尔",
            "2": "暗黑武士 雷恩加尔",
            "8": "霸天战士 雷恩加尔"
        }
    },
    "104": {
        "hero": "Graves",
        "skins": {
            "14": "胜利枪神 格雷福斯",
            "1": "怒之火炮 格雷福斯",
            "0": "格雷福斯 格雷福斯",
            "3": "黑帮教父 格雷福斯",
            "2": "杀出重围 格雷福斯",
            "5": "泳池派对 格雷福斯",
            "4": "防暴士兵 格雷福斯",
            "7": "冰雪节 格雷福斯",
            "6": "无情重炮 格雷福斯"
        }
    },
    "105": {
        "hero": "Fizz",
        "skins": {
            "10": "欧米伽小队 鬼影蛙人",
            "1": "失落大陆 菲兹",
            "0": "菲兹 菲兹",
            "3": "海牛猎手 菲兹",
            "2": "苔原猎手 菲兹",
            "4": "虚空海灵 菲兹",
            "9": "银河魔装机神 菲兹",
            "8": "兔宝宝 菲兹"
        }
    },
    "39": {
        "hero": "Irelia",
        "skins": {
            "1": "夜刃 艾瑞莉娅",
            "0": "艾瑞莉娅 艾瑞莉娅",
            "3": "夜行义贼 艾瑞莉娅",
            "2": "凌云之翼 艾瑞莉娅",
            "5": "莲花之令 艾瑞莉娅",
            "4": "冰霜之刃 艾瑞莉娅",
            "6": "玉剑传说 舞剑仙"
        }
    },
    "38": {
        "hero": "Kassadin",
        "skins": {
            "1": "寒冰王座 卡萨丁",
            "0": "卡萨丁 卡萨丁",
            "3": "虚空前世 卡萨丁",
            "2": "深海一号 卡萨丁",
            "5": "掠星魔刃 卡萨丁",
            "4": "先驱行者 卡萨丁"
        }
    },
    "33": {
        "hero": "Rammus",
        "skins": {
            "1": "国王 拉莫斯",
            "0": "拉莫斯 拉莫斯",
            "3": "熔火之心 拉莫斯",
            "2": "铬金铠甲 拉莫斯",
            "5": "忍龟 拉莫斯",
            "4": "极度深寒 拉莫斯",
            "7": "圣金甲虫 拉莫斯",
            "6": "全金属狂潮 拉莫斯"
        }
    },
    "32": {
        "hero": "Amumu",
        "skins": {
            "1": "法老 阿木木",
            "0": "阿木木 阿木木",
            "3": "情绪摇滚 阿木木",
            "2": "狂欢 阿木木",
            "5": "王子不是我 阿木木",
            "4": "阿木木 阿木木",
            "7": "殇之机器人 阿木木",
            "6": "小小骑士 阿木木",
            "8": "惊悚派对 阿木木"
        }
    },
    "31": {
        "hero": "Chogath",
        "skins": {
            "1": "梦魇 科加斯",
            "0": "科加斯 科加斯",
            "3": "尼斯巨兽 科加斯",
            "2": "绅士 科加斯",
            "5": "战地巨兽 科加斯",
            "4": "侏罗纪化石 科加斯",
            "6": "暴龙 科加斯"
        }
    },
    "30": {
        "hero": "Karthus",
        "skins": {
            "1": "幽灵幻影 卡尔萨斯",
            "0": "卡尔萨斯 卡尔萨斯",
            "3": "死神 卡尔萨斯",
            "2": "自由女神 卡尔萨斯",
            "5": "Fnatic 卡尔萨斯",
            "4": "五杀摇滚主唱 卡尔萨斯",
            "9": "祸害之光 卡尔萨斯"
        }
    },
    "37": {
        "hero": "Sona",
        "skins": {
            "1": "缪斯女神 娑娜",
            "0": "娑娜 娑娜",
            "3": "平安夜女神 娑娜",
            "2": "五杀摇滚键盘手 娑娜",
            "5": "电玩女神 娑娜",
            "4": "古琴余韵 娑娜",
            "7": "甜心宝贝 娑娜",
            "6": "DJ 娑娜"
        }
    },
    "36": {
        "hero": "DrMundo",
        "skins": {
            "1": "战栗之毒 蒙多",
            "0": "蒙多 蒙多",
            "3": "律政大亨 蒙多",
            "2": "健美教练 蒙多",
            "5": "嗜血行刑 蒙多",
            "4": "蒙多蒙多 蒙多",
            "7": "暗杀星 蒙多",
            "6": "战争血统 蒙多",
            "9": "硬汉 蒙多",
            "8": "泳池派对 蒙多"
        }
    },
    "35": {
        "hero": "Shaco",
        "skins": {
            "1": "恐怖之源 萨科",
            "0": "萨科 萨科",
            "3": "胡桃夹子 萨科",
            "2": "贵族血统 萨科",
            "5": "飞越疯人院 萨科",
            "4": "小丑工作坊 萨科",
            "7": "万能小丑 萨科",
            "6": "武动巅峰 萨科"
        }
    },
    "34": {
        "hero": "Anivia",
        "skins": {
            "1": "双重冰晶 艾尼维亚",
            "0": "艾尼维亚 艾尼维亚",
            "3": "重甲猎鹰 艾尼维亚",
            "2": "联盟之喙 艾尼维亚",
            "5": "黯晶凤凰 艾尼维亚",
            "4": "钢铁之翼 艾尼维亚",
            "7": "庆典女皇 艾尼维亚",
            "6": "翼龙 艾尼维亚"
        }
    },
    "60": {
        "hero": "Elise",
        "skins": {
            "1": "死亡绽放 伊莉丝",
            "0": "伊莉丝 伊莉丝",
            "3": "腥红之月 伊莉丝",
            "2": "胜利女神 伊莉丝",
            "5": "银河魔装机神 伊莉丝",
            "4": "SKT T1 伊莉丝"
        }
    },
    "61": {
        "hero": "Orianna",
        "skins": {
            "1": "哥特女仆 奥莉安娜",
            "0": "奥莉安娜 奥莉安娜",
            "3": "灵骨工匠 奥莉安娜",
            "2": "恶灵布偶 奥莉安娜",
            "5": "冬季仙境 奥莉安娜",
            "4": "暗杀星 奥莉安娜",
            "7": "死兆星 奥莉安娜",
            "6": "觅心魔灵 奥莉安娜"
        }
    },
    "62": {
        "hero": "MonkeyKing",
        "skins": {
            "1": "三昧真火 孙悟空",
            "0": "孙悟空 孙悟空",
            "3": "定海神珍 孙悟空",
            "2": "斗战胜佛 孙悟空",
            "5": "美猴王 孙悟空",
            "4": "地狱行者 孙悟空",
            "6": "破空枪骑 孙悟空"
        }
    },
    "63": {
        "hero": "Brand",
        "skins": {
            "1": "末日余生 布兰德",
            "0": "布兰德 布兰德",
            "3": "冰晶之核 布兰德",
            "2": "V字仇杀者 布兰德",
            "5": "灵魂烈焰 布兰德",
            "4": "丧尸 布兰德",
            "6": "战场BOSS 布兰德"
        }
    },
    "64": {
        "hero": "LeeSin",
        "skins": {
            "11": "神拳 李青",
            "10": "地下拳王 李青",
            "1": "传统僧侣 李青",
            "0": "李青 李青",
            "3": "龙的传人 李青",
            "2": "防弹武僧 李青",
            "5": "泳池派对 李青",
            "4": "至高之拳 李青",
            "6": "SKT T1 李青"
        }
    },
    "67": {
        "hero": "Vayne",
        "skins": {
            "11": "源计划：净化 薇恩",
            "10": "摄魂使者 薇恩",
            "1": "摩登骇客 薇恩",
            "0": "薇恩 薇恩",
            "3": "屠龙勇士 薇恩",
            "2": "猎天使魔女 薇恩",
            "5": "SKT T1 薇恩",
            "4": "觅心猎手 薇恩",
            "6": "苍穹之光 薇恩"
        }
    },
    "68": {
        "hero": "Rumble",
        "skins": {
            "1": "热带丛林 兰博",
            "0": "兰博 兰博",
            "3": "银河魔装机神 兰博",
            "2": "独眼海盗 兰博",
            "4": "废土男爵 兰博"
        }
    },
    "69": {
        "hero": "Cassiopeia",
        "skins": {
            "1": "荒漠之咬 卡西奥佩娅",
            "0": "卡西奥佩娅 卡西奥佩娅",
            "3": "蛇发女妖 卡西奥佩娅",
            "2": "深海妖姬 卡西奥佩娅",
            "4": "碧玉之牙 卡西奥佩娅",
            "8": "上古魔蛇 卡西奥佩娅"
        }
    },
    "254": {
        "hero": "Vi",
        "skins": {
            "11": "源计划：裁决 蔚",
            "1": "霓虹杀拳 蔚",
            "0": "蔚 蔚",
            "3": "铁拳执事 蔚",
            "2": "女警官 蔚",
            "5": "虎痴之拳 蔚",
            "4": "炼狱魔女 蔚"
        }
    },
    "2": {
        "hero": "Olaf",
        "skins": {
            "15": "SKT T1 奥拉夫",
            "1": "烈焰猛士 奥拉夫",
            "0": "奥拉夫 奥拉夫",
            "3": "铁哥们儿 奥拉夫",
            "2": "冰河时代 奥拉夫",
            "5": "黑暗骑士 奥拉夫",
            "4": "五杀摇滚鼓手 奥拉夫",
            "6": "牛扒狂战 奥拉夫"
        }
    },
    "6": {
        "hero": "Urgot",
        "skins": {
            "1": "深渊巨蟹 厄加特",
            "0": "厄加特 厄加特",
            "3": "战地机甲 厄加特",
            "2": "电锯狂人 厄加特"
        }
    },
    "99": {
        "hero": "Lux",
        "skins": {
            "1": "奥术光辉 拉克丝",
            "0": "拉克丝 拉克丝",
            "3": "ODST地狱伞兵 拉克丝",
            "2": "游侠法师 拉克丝",
            "5": "钢铁军团 拉克丝",
            "4": "星际迷航 拉克丝",
            "7-Air": "大元素使 拉克丝",
            "7-Dark": "大元素使 拉克丝",
            "7-Fire": "大元素使 拉克丝",
            "7-Ice": "大元素使 拉克丝",
            "7-Light": "大元素使 拉克丝",
            "7-Magma": "大元素使 拉克丝",
            "7-Mystic": "大元素使 拉克丝",
            "7-Nature": "大元素使 拉克丝",
            "7-Storm": "大元素使 拉克丝",
            "7-Water": "大元素使 拉克丝",
            "6": "星之守护者 拉克丝",
            "8": "春晖神女 拉克丝"
        }
    },
    "98": {
        "hero": "Shen",
        "skins": {
            "1": "极寒 慎",
            "0": "慎 慎",
            "3": "主治医师 慎",
            "2": "炎爆 慎",
            "5": "战国大名 慎",
            "4": "腥红之月鬼武者 慎",
            "6": "暗杀星 慎"
        }
    },
    "91": {
        "hero": "Talon",
        "skins": {
            "1": "刺客信条 泰隆",
            "0": "泰隆 泰隆",
            "3": "银龙裁决 泰隆",
            "2": "血色精锐 泰隆",
            "5": "腥红之月 泰隆",
            "4": "SSW 泰隆",
            "12": "玉剑传说 无影"
        }
    },
    "90": {
        "hero": "Malzahar",
        "skins": {
            "1": "元老议会 玛尔扎哈",
            "0": "玛尔扎哈 玛尔扎哈",
            "3": "魔灵 玛尔扎哈",
            "2": "暗影王子 玛尔扎哈",
            "5": "冰雪节 玛尔扎哈",
            "4": "至高君王 玛尔扎哈",
            "6": "战场BOSS 玛尔扎哈"
        }
    },
    "92": {
        "hero": "Riven",
        "skins": {
            "16": "黎明使者 锐雯",
            "1": "刺客信条 锐雯",
            "0": "锐雯 锐雯",
            "3": "兔女郎 锐雯",
            "2": "血色精锐 锐雯",
            "5": "替父从军 花木兰",
            "4": "冠军之刃 锐雯",
            "7": "冠军之刃 锐雯 2016",
            "6": "电玩勇者 锐雯"
        }
    },
    "222": {
        "hero": "Jinx",
        "skins": {
            "12": "圣诞捣蛋鬼 金克丝",
            "1": "黑帮狂花 金克丝",
            "0": "金克丝 金克丝",
            "3": "丧尸杀手 金克丝",
            "2": "神龙烈焰 金克丝",
            "4": "星之守护者 金克丝"
        }
    },
    "96": {
        "hero": "KogMaw",
        "skins": {
            "10": "海克斯科技 克格莫",
            "1": "毛毛虫 克格莫",
            "0": "克格莫 克格莫",
            "3": "帝王斑蝶 克格莫",
            "2": "索诺拉沙虫 克格莫",
            "5": "醒狮 克格莫",
            "4": "圣诞驯鹿 克格莫",
            "7": "侏罗纪化石 克格莫",
            "6": "深海怪鱼 克格莫",
            "9": "克格汪 克格莫",
            "8": "战地机甲 克格莫"
        }
    },
    "11": {
        "hero": "MasterYi",
        "skins": {
            "11": "玉剑传说 无极",
            "10": "斩星魔剑 易",
            "1": "暗影 易",
            "0": "易 易",
            "3": "天人合一 易",
            "2": "星战 易",
            "5": "铁血剑豪 易",
            "4": "侍魂 易",
            "9": "源计划：林 易"
        }
    },
    "10": {
        "hero": "Kayle",
        "skins": {
            "1": "银白审判 凯尔",
            "0": "凯尔 凯尔",
            "3": "大天使长米迦勒 凯尔",
            "2": "末世天使 凯尔",
            "4": "战场女武神 凯尔",
            "7": "防暴天使 凯尔",
            "6": "钢铁之翼 凯尔",
            "9": "五杀摇滚女声主唱 凯尔",
            "8": "钢铁审判官 凯尔"
        }
    },
    "13": {
        "hero": "Ryze",
        "skins": {
            "10": "SKT T1 瑞兹",
            "1": "青年 瑞兹",
            "0": "瑞兹 瑞兹",
            "3": "美国大叔 瑞兹",
            "2": "部落精神 瑞兹",
            "5": "宗师级法师训练师 瑞兹",
            "4": "守护者雕像 瑞兹",
            "7": "恶魔男爵 瑞兹",
            "6": "至死不渝 瑞兹",
            "9": "瑞兹·白须 瑞兹",
            "8": "海贼 瑞兹 瑞兹"
        }
    },
    "12": {
        "hero": "Alistar",
        "skins": {
            "10": "哞利斯塔 阿利斯塔",
            "19": "海克斯科技 阿利斯塔",
            "1": "暗黑灵魂 阿利斯塔",
            "0": "阿利斯塔 阿利斯塔",
            "3": "斗牛士 阿利斯塔",
            "2": "金牛座 阿利斯塔",
            "5": "巨角幻兽 阿利斯塔",
            "4": "荒野镖客 阿利斯塔",
            "7": "后场堡垒 阿利斯塔",
            "6": "地狱火 阿利斯塔",
            "9": "SKT T1 阿利斯塔",
            "8": "黑暗骑士 阿利斯塔"
        }
    },
    "15": {
        "hero": "Sivir",
        "skins": {
            "10": "送披萨的小姐姐 希维尔",
            "1": "战场公主 希维尔",
            "0": "希维尔 希维尔",
            "3": "女猎手 希维尔",
            "2": "亮丽女神 希维尔",
            "5": "创战纪 希维尔",
            "4": "钢铁之心 希维尔",
            "7": "光明骑士 希维尔",
            "6": "冰雪风暴 希维尔",
            "9": "新创战纪 希维尔",
            "8": "胜利女神 希维尔"
        }
    },
    "14": {
        "hero": "Sion",
        "skins": {
            "1": "钢铁终结者 赛恩",
            "0": "赛恩 赛恩",
            "3": "原野伐木工 赛恩",
            "2": "武仙座海格力斯 赛恩",
            "5": "霸天零式 赛恩",
            "4": "战争机器 赛恩"
        }
    },
    "17": {
        "hero": "Teemo",
        "skins": {
            "14": "大魔王 提莫",
            "1": "圣诞开心鬼 提莫",
            "0": "提莫 提莫",
            "3": "密林猎手 提莫",
            "2": "军情五处 提莫",
            "5": "兔宝宝 提莫",
            "4": "提莫 提莫",
            "7": "熊猫 提莫",
            "6": "约德尔国队长 提莫",
            "8": "欧米伽小队 幽灵特工"
        }
    },
    "16": {
        "hero": "Soraka",
        "skins": {
            "1": "森林女神 索拉卡",
            "0": "索拉卡 索拉卡",
            "3": "圣洁化身 索拉卡",
            "2": "月光女神阿忒弥斯 索拉卡",
            "5": "蕉泥座人 索拉卡",
            "4": "灵魂收割者 索拉卡",
            "7": "星之守护者 索拉卡",
            "6": "源代码 索拉卡"
        }
    },
    "19": {
        "hero": "Warwick",
        "skins": {
            "10": "南天之怒 沃里克 ",
            "1": "暗影 沃里克",
            "0": "沃里克 沃里克",
            "3": "狼外婆 沃里克",
            "2": "披着海牛的狼 沃里克",
            "5": "嗜血狂暴 沃里克",
            "4": "冻原猎手 沃里克",
            "7": "荒野豺狼 沃里克",
            "6": "火牙狼人 沃里克",
            "9": "海牛狼人 沃里克",
            "8": "黑暗骑士 沃里克"
        }
    },
    "18": {
        "hero": "Tristana",
        "skins": {
            "11": "魅惑女巫 崔丝塔娜",
            "10": "驯龙炮手 崔丝塔娜",
            "12": "欧米伽小队 魔鬼伞兵",
            "1": "粉色萝莉 崔丝塔娜",
            "0": "崔丝塔娜 崔丝塔娜",
            "3": "烈焰雄心 崔丝塔娜",
            "2": "圣诞精灵 崔丝塔娜 ",
            "5": "约德尔海贼团 崔丝塔娜",
            "4": "游击队员 崔丝塔娜",
            "6": "火箭达人 崔丝塔娜"
        }
    },
    "154": {
        "hero": "Zac",
        "skins": {
            "1": "邪恶魔人 扎克",
            "0": "扎克 扎克",
            "2": "泳池派对 扎克",
            "6": "SKT T1 扎克"
        }
    },
    "157": {
        "hero": "Yasuo",
        "skins": {
            "1": "西部牛仔 亚索",
            "0": "亚索 亚索",
            "3": "腥红之月 亚索",
            "2": "源计划：风 亚索",
            "9": "黑夜使者 亚索"
        }
    },
    "238": {
        "hero": "Zed",
        "skins": {
            "11": "死亡誓约 劫",
            "10": "冠军之隐 劫",
            "1": "冲击之刃 劫",
            "0": "劫 劫",
            "3": "源计划：阴 劫",
            "2": "SKT T1 劫"
        }
    },
    "236": {
        "hero": "Lucian",
        "skins": {
            "1": "职业杀手 卢锡安",
            "0": "卢锡安 卢锡安",
            "2": "夺命前锋 卢锡安",
            "7": "觅心游侠 卢锡安",
            "6": "源计划：雷 卢锡安"
        }
    },
    "48": {
        "hero": "Trundle",
        "skins": {
            "1": "里尔击球手  特朗德尔",
            "0": "特朗德尔 特朗德尔",
            "3": "传统造型 特朗德尔",
            "2": "垃圾场  特朗德尔",
            "5": "灭世魔神 特朗德尔",
            "4": "巡逻警官 特朗德尔"
        }
    },
    "119": {
        "hero": "Draven",
        "skins": {
            "12": "圣诞老人 德莱文",
            "1": "灵魂收割者 德莱文",
            "0": "德莱文 德莱文",
            "3": "金牌主播 德莱文",
            "2": "绞肉机刽子手 德莱文",
            "5": "野兽猎人 德莱文",
            "4": "泳池派对 德莱文",
            "6": "德莱德莱德莱文 德莱文"
        }
    },
    "44": {
        "hero": "Taric",
        "skins": {
            "1": "绿水晶光辉 塔里克",
            "0": "塔里克 塔里克",
            "3": "血精石诅咒 塔里克",
            "2": "紫水晶意志 塔里克",
            "4": "泳池派对 塔里克"
        }
    },
    "45": {
        "hero": "Veigar",
        "skins": {
            "1": "白魔法师 维迦",
            "0": "维迦 维迦",
            "3": "灰胡子魔法师 维迦",
            "2": "冰壶选手 维迦",
            "5": "魔导绅士 维迦",
            "4": "绿野仙踪 维迦",
            "7": "邪恶圣诞老人 维迦",
            "6": "穿着正装的恶魔 维迦",
            "9": "欧米伽小队 天雷爆破手",
            "8": "最终BOSS 维迦"
        }
    },
    "42": {
        "hero": "Corki",
        "skins": {
            "1": "外星装甲 库奇",
            "0": "库奇 库奇",
            "3": "红色男爵 库奇",
            "2": "雪橇速滑 库奇",
            "5": "海牛骑手  库奇",
            "4": "急速前进 库奇",
            "7": "Fnatic 库奇",
            "6": "神龙之翼 库奇",
            "8": "电玩上校 库奇"
        }
    },
    "43": {
        "hero": "Karma",
        "skins": {
            "1": "日冕女神 卡尔玛",
            "0": "卡尔玛 卡尔玛",
            "3": "传统服饰 卡尔玛",
            "2": "樱花乱舞 卡尔玛",
            "5": "光明骑士 卡尔玛",
            "4": "莲花之令 卡尔玛",
            "7": "征服者 卡尔玛",
            "6": "冬季仙境 卡尔玛"
        }
    },
    "40": {
        "hero": "Janna",
        "skins": {
            "1": "暴风女神 迦娜",
            "0": "迦娜 迦娜",
            "3": "寒冰女皇 迦娜",
            "2": "海克斯科技 迦娜",
            "5": "女主播 迦娜",
            "4": "胜利女神 迦娜",
            "7": "星之守护者 迦娜",
            "6": "Fnatic 迦娜",
            "8": "玉剑传说 风仙子"
        }
    },
    "41": {
        "hero": "Gangplank",
        "skins": {
            "1": "幽灵船长 普朗克",
            "0": "普朗克 普朗克",
            "3": "大力水手 普朗克",
            "2": "老兵 普朗克",
            "5": "特种部队 普朗克",
            "4": "英勇玩具兵 普朗克",
            "7": "昔日霸主 普朗克",
            "6": "奥斯曼大帝 普朗克",
            "8": "恐惧新星 普朗克"
        }
    },
    "1": {
        "hero": "Annie",
        "skins": {
            "11": "银河魔装机神 安妮",
            "10": "海克斯科技 安妮",
            "1": "哥特萝莉 安妮",
            "0": "安妮 安妮",
            "3": "安妮梦游仙境 安妮",
            "2": "小红帽 安妮",
            "5": "冰霜烈焰 安妮",
            "4": "舞会公主 安妮",
            "7": "科学怪熊的新娘 安妮",
            "6": "安伯斯与提妮 安妮",
            "9": "甜心宝贝 安妮",
            "8": "“你看见过我的熊猫吗？” 安妮"
        }
    },
    "5": {
        "hero": "XinZhao",
        "skins": {
            "13": "屠龙勇士 赵信",
            "1": "特战先锋 赵信",
            "0": "赵信 赵信",
            "3": "绞肉机角斗士 赵信",
            "2": "皇家守卫 赵信",
            "5": "赵云 子龙",
            "4": "翼骑统领 赵信",
            "6": "秘密特工 赵信"
        }
    },
    "9": {
        "hero": "FiddleSticks",
        "skins": {
            "1": "幽魂 费德提克",
            "0": "费德提克 费德提克",
            "3": "荒野幽灵 费德提克",
            "2": "联合王国 费德提克",
            "5": "铁钩船长 费德提克",
            "4": "南瓜头 费德提克",
            "7": "糖果使徒 费德提克",
            "6": "惊悚派对 费德提克",
            "8": "重生之沙 费德提克"
        }
    },
    "201": {
        "hero": "Braum",
        "skins": {
            "1": "屠龙勇士 布隆",
            "0": "布隆 布隆 布隆",
            "3": "布隆·狮心 布隆",
            "2": "猛虎 布隆 布隆",
            "10": "圣诞老人 布隆"
        }
    },
    "143": {
        "hero": "Zyra",
        "skins": {
            "1": "野火之藤 婕拉",
            "0": "婕拉 婕拉",
            "3": "SKT T1 婕拉",
            "2": "鬼影森森 婕拉",
            "4": "驯龙女巫 婕拉"
        }
    },
    "77": {
        "hero": "Udyr",
        "skins": {
            "1": "武力全开 乌迪尔",
            "0": "乌迪尔 乌迪尔",
            "3": "灵魂守卫 乌迪尔",
            "2": "四神之力 乌迪尔",
            "4": "这货不是 乌迪尔"
        }
    },
    "76": {
        "hero": "Nidalee",
        "skins": {
            "1": "雪装 奈德丽",
            "0": "奈德丽 奈德丽",
            "3": "法国女仆 奈德丽",
            "2": "丛林猎豹 奈德丽",
            "5": "魅惑女巫 奈徳丽",
            "4": "艳后 奈德丽",
            "7": "枭姬 孙尚香",
            "6": "铁血猎手 奈德丽",
            "9": "银河魔装机神 奈德丽",
            "8": "勇者 奈德丽"
        }
    },
    "75": {
        "hero": "Nasus",
        "skins": {
            "11": "北辰之威 内瑟斯",
            "10": "灭世魔神 内瑟斯",
            "1": "星空之门 内瑟斯",
            "0": "内瑟斯 内瑟斯",
            "3": "死亡骑士 内瑟斯",
            "2": "法老王朝 内瑟斯",
            "5": "炼狱魔犬 内瑟斯",
            "4": "警用试作体K-9 内瑟斯",
            "6": "单身贵族 内瑟斯"
        }
    },
    "74": {
        "hero": "Heimerdinger",
        "skins": {
            "1": "第三类接触 黑默丁格",
            "0": "黑默丁格 黑默丁格",
            "3": "创意工坊 黑默丁格",
            "2": "拆弹专家 黑默丁格",
            "5": "生化博士 黑默丁格",
            "4": "雪默丁格 黑默丁格"
        }
    },
    "72": {
        "hero": "Skarner",
        "skins": {
            "1": "沙暴巨蝎 斯卡纳",
            "0": "斯卡纳 斯卡纳",
            "3": "战地机甲 斯卡纳",
            "2": "远土之灵 斯卡纳",
            "4": "圣金甲虫 斯卡纳"
        }
    },
    "79": {
        "hero": "Gragas",
        "skins": {
            "10": "冰原核弹 古拉加斯",
            "1": "深潜蛙人 古拉加斯",
            "0": "古拉加斯 古拉加斯",
            "3": "圣诞老人 古拉加斯",
            "2": "乡村农夫 古拉加斯",
            "5": "飞车暴走族 古拉加斯",
            "4": "品酒大师 古拉加斯",
            "7": "狂热球迷 古拉加斯",
            "6": "美酒节特使 古拉加斯",
            "9": "古拉加斯·碎桶者 古拉加斯",
            "8": "Fnatic 古拉加斯"
        }
    },
    "78": {
        "hero": "Poppy",
        "skins": {
            "14": "冰雪驯鹿 波比",
            "1": "诺克萨斯 波比",
            "0": "波比 波比",
            "3": "宗师级锻造训练师 波比",
            "2": "波比的巧克力工坊 波比",
            "5": "军神战甲 波比",
            "4": "圣诞玩偶 波比",
            "7": "星之守护者 波比",
            "6": "血色之锤 波比"
        }
    }
}

hero_map = {
    "MonkeyKing": "孙悟空",
    "Jax": "贾克斯",
    "Shaco": "萨科",
    "Warwick": "沃里克",
    "Nidalee": "奈德丽",
    "Zyra": "婕拉",
    "Brand": "布兰德",
    "Rammus": "拉莫斯",
    "Corki": "库奇",
    "Braum": "布隆",
    "Anivia": "艾尼维亚",
    "Tryndamere": "泰达米尔",
    "MissFortune": "厄运小姐",
    "Yorick": "约里克",
    "Xerath": "泽拉斯",
    "Sivir": "希维尔",
    "Riven": "锐雯",
    "Orianna": "奥莉安娜",
    "Gangplank": "普朗克",
    "Malphite": "墨菲特",
    "Poppy": "波比",
    "Karthus": "卡尔萨斯",
    "Jayce": "杰斯",
    "Diana": "黛安娜",
    "Trundle": "特朗德尔",
    "Sejuani": "瑟庄妮",
    "Graves": "格雷福斯",
    "Lucian": "卢锡安",
    "Nocturne": "魔腾",
    "Lux": "拉克丝",
    "Shyvana": "希瓦娜",
    "Renekton": "雷克顿",
    "Fiora": "菲奥娜",
    "Jinx": "金克丝",
    "Kalista": "卡莉丝塔",
    "Fizz": "菲兹",
    "Kassadin": "卡萨丁",
    "Sona": "娑娜",
    "Vladimir": "弗拉基米尔",
    "Viktor": "维克托",
    "Cassiopeia": "卡西奥佩娅",
    "Maokai": "茂凯",
    "Thresh": "锤石",
    "Kayle": "凯尔",
    "Hecarim": "赫卡里姆",
    "Khazix": "卡兹克",
    "Olaf": "奥拉夫",
    "Ziggs": "吉格斯",
    "Syndra": "辛德拉",
    "DrMundo": "蒙多",
    "Karma": "卡尔玛",
    "Annie": "安妮",
    "Akali": "阿卡丽",
    "Volibear": "沃利贝尔",
    "Yasuo": "亚索",
    "Kennen": "凯南",
    "Rengar": "雷恩加尔",
    "Ryze": "瑞兹",
    "Shen": "慎",
    "Zac": "扎克",
    "Pantheon": "潘森",
    "Swain": "斯维因",
    "Sion": "赛恩",
    "Vayne": "薇恩",
    "Nasus": "内瑟斯",
    "TwistedFate": "崔斯特",
    "Chogath": "科加斯",
    "Udyr": "乌迪尔",
    "Morgana": "莫甘娜",
    "Leona": "蕾欧娜",
    "Caitlyn": "凯特琳",
    "Nunu": "努努",
    "Zilean": "基兰",
    "Azir": "阿兹尔",
    "Rumble": "兰博",
    "Skarner": "斯卡纳",
    "Teemo": "提莫",
    "Urgot": "厄加特",
    "Amumu": "阿木木",
    "Galio": "加里奥",
    "Heimerdinger": "黑默丁格",
    "Ashe": "艾希",
    "Velkoz": "维克兹",
    "Singed": "辛吉德",
    "Varus": "韦鲁斯",
    "Twitch": "图奇",
    "Garen": "盖伦",
    "Blitzcrank": "布里茨",
    "MasterYi": "易",
    "Elise": "伊莉丝",
    "Alistar": "阿利斯塔",
    "Katarina": "卡特琳娜",
    "Mordekaiser": "莫德凯撒",
    "KogMaw": "克格莫",
    "Aatrox": "亚托克斯",
    "Draven": "德莱文",
    "FiddleSticks": "费德提克",
    "Talon": "泰隆",
    "XinZhao": "赵信",
    "LeeSin": "李青",
    "Taric": "塔里克",
    "Malzahar": "玛尔扎哈",
    "Lissandra": "丽桑卓",
    "Tristana": "崔丝塔娜",
    "RekSai": "雷克塞",
    "Irelia": "艾瑞莉娅",
    "JarvanIV": "嘉文四世",
    "Nami": "娜美",
    "Soraka": "索拉卡",
    "Veigar": "维迦",
    "Janna": "风仙子",
    "Nautilus": "诺提勒斯",
    "Evelynn": "伊芙琳",
    "Gragas": "古拉加斯",
    "Zed": "劫",
    "Vi": "蔚",
    "Lulu": "璐璐",
    "Ahri": "阿狸",
    "Quinn": "奎因",
    "Leblanc": "乐芙兰",
    "Ezreal": "伊泽瑞尔",
    "TahmKench": "塔姆",
    "Pyke": "派克",
    "Bard": "巴德",
    "Zoe": "佐伊",
    "Ekko": "艾克",
    "AurelionSol": "奥瑞利安·索尔",
    "Xayah": "霞",
    "Kaisa": "卡莎",
    "Jhin": "烬",
    "Taliyah": "塔莉垭",
    "Kindred": "千钰",
    "Kayn": "凯隐",
    "Ivern": "艾翁",
    "Camille": "卡蜜尔",
    "Ornn": "奥恩",
    "Kled": "克烈",
    "Illaoi": "俄洛伊"
}

hero_map_id = {
    "MonkeyKing": "猴子",
    "Jax": "武器大师",
    "Shaco": "小丑",
    "Warwick": "狼人",
    "Nidalee": "豹女",
    "Zyra": "婕拉",
    "Brand": "火男",
    "Rammus": "龙龟",
    "Corki": "飞机",
    "Braum": "布隆",
    "Anivia": "冰鸟",
    "Tryndamere": "蛮王",
    "MissFortune": "女枪",
    "Yorick": "掘墓",
    "Xerath": "泽拉斯",
    "Sivir": "轮子妈",
    "Riven": "锐雯",
    "Orianna": "发条",
    "Gangplank": "船长",
    "Malphite": "石头人",
    "Poppy": "波比",
    "Karthus": "死歌",
    "Jayce": "杰斯",
    "Diana": "皎月",
    "Trundle": "巨魔",
    "Sejuani": "猪妹",
    "Graves": "男枪",
    "Lucian": "卢锡安",
    "Nocturne": "梦靥",
    "Lux": "拉克丝",
    "Shyvana": "龙女",
    "Renekton": "鳄鱼",
    "Fiora": "剑姬",
    "Jinx": "金克丝",
    "Kalista": "滑板鞋",
    "Fizz": "小鱼人",
    "Kassadin": "卡萨丁",
    "Sona": "琴女",
    "Vladimir": "吸血鬼",
    "Viktor": "三只手",
    "Cassiopeia": "蛇女",
    "Maokai": "大树",
    "Thresh": "锤石",
    "Kayle": "天使",
    "Hecarim": "人马",
    "Khazix": "螳螂",
    "Olaf": "奥拉夫",
    "Ziggs": "炸弹人",
    "Syndra": "辛德拉",
    "DrMundo": "蒙多",
    "Karma": "扇子妈",
    "Annie": "安妮",
    "Akali": "阿卡丽",
    "Volibear": "狗熊",
    "Yasuo": "快乐风男",
    "Kennen": "凯南",
    "Rengar": "狮子狗",
    "Ryze": "瑞兹",
    "Shen": "慎",
    "Zac": "扎克",
    "Pantheon": "潘森",
    "Swain": "乌鸦",
    "Sion": "赛恩",
    "Vayne": "薇恩",
    "Nasus": "狗头",
    "TwistedFate": "卡牌",
    "Chogath": "大虫子",
    "Udyr": "乌迪尔",
    "Morgana": "莫甘娜",
    "Leona": "日女",
    "Caitlyn": "女警",
    "Nunu": "努努",
    "Zilean": "时光老头",
    "Azir": "黄鸡",
    "Rumble": "兰博",
    "Skarner": "蝎子",
    "Teemo": "提百万",
    "Urgot": "厄加特",
    "Amumu": "阿木木",
    "Galio": "加里奥",
    "Heimerdinger": "大头",
    "Ashe": "寒冰",
    "Velkoz": "大眼怪",
    "Singed": "炼金",
    "Varus": "韦鲁斯",
    "Twitch": "老鼠",
    "Garen": "盖伦",
    "Blitzcrank": "机器人",
    "MasterYi": "剑圣",
    "Elise": "蜘蛛",
    "Alistar": "牛头",
    "Katarina": "卡特",
    "Mordekaiser": "铁男",
    "KogMaw": "大嘴",
    "Aatrox": "剑魔",
    "Draven": "德莱文",
    "FiddleSticks": "稻草人",
    "Talon": "男刀",
    "XinZhao": "赵信",
    "LeeSin": "盲僧",
    "Taric": "宝石",
    "Malzahar": "蚂蚱",
    "Lissandra": "冰女",
    "Tristana": "小炮",
    "RekSai": "挖掘机",
    "Irelia": "刀妹",
    "JarvanIV": "皇子",
    "Nami": "娜美",
    "Soraka": "索拉卡",
    "Veigar": "小法",
    "Janna": "迦娜",
    "Nautilus": "泰坦",
    "Evelynn": "寡妇",
    "Gragas": "酒桶",
    "Zed": "劫",
    "Vi": "蔚",
    "Lulu": "璐璐",
    "Ahri": "狐狸",
    "Quinn": "奎因",
    "Leblanc": "妖姬",
    "Ezreal": "EZ",
    "TahmKench": "塔姆",
    "Pyke": "派克",
    "Bard": "巴德",
    "Zoe": "佐伊",
    "Ekko": "艾克",
    "AurelionSol": "奥瑞利安·索尔",
    "Xayah": "霞",
    "Kaisa": "卡莎",
    "Jhin": "烬",
    "Taliyah": "塔莉垭",
    "Kindred": "千钰",
    "Kayn": "凯隐",
    "Ivern": "艾翁",
    "Camille": "卡蜜尔",
    "Ornn": "奥恩",
    "Kled": "克烈",
    "Illaoi": "俄洛伊"
}
hot = ["亚索", "菲兹", "锐雯", "辛吉德", "德莱厄斯"]
top = ["亚托克斯", "科加斯", "蒙多", "菲奥娜", "普朗克", "盖伦", "纳尔", "俄洛伊", "黑默丁格", "贾克斯", "杰斯", "凯南", "克烈", "墨菲特", "茂凯", "内瑟斯", "奥恩",
       "波比", "奎因", "雷克顿", "兰博", "提莫", "泰达米尔", "厄加特", "约里克"]
jungle = ["阿木木", "卡蜜尔", "伊莉丝", "伊芙琳", "古拉加斯", "格雷福斯", "赫卡里姆", "艾翁", "嘉文四世", "凯隐", "卡兹克", "千珏", "李青", "易", "孙悟空", "奈德丽",
          "魔腾", "努努", "奥拉夫", "潘森", "拉莫斯", "雷克塞", "雷恩加尔", "瑟庄妮", "萨科", "希瓦娜", "斯卡纳", "塔莉垭", "特朗德尔", "蔚", "沃利贝尔", "沃里克",
          "乌迪尔", "赵信", "扎克"]
adc = ["艾希", "凯特琳", "德莱文", "伊泽瑞尔", "烬", "金克丝", "卡莎", "卡莉斯塔", "克格莫", "卢锡安", "厄运小姐", "莫德凯撒", "希维尔", "斯维因", "图奇", "韦鲁斯",
       "薇恩", "霞"]
mid = ["阿狸", "阿卡丽", "艾尼维亚", "安妮", "奥瑞利安·索尔", "阿兹尔", "布兰德", "卡西奥佩娅", "库奇", "黛安娜", "艾克", "加里奥", "艾瑞莉娅", "卡尔萨斯", "卡萨丁",
       "卡特琳娜", "凯尔", "乐芙兰", "丽桑卓", "璐璐", "拉克丝", "玛尔扎哈", "奥莉安娜", "瑞兹", "赛恩", "辛德拉", "泰隆", "崔斯特", "维迦", "维克兹", "维克托",
       "弗拉基米尔", "泽拉斯", "劫", "吉格斯", "基兰", "佐伊"]
support = ["阿利斯塔", "巴德", "布里茨", "布隆", "费德提克", "迦娜", "卡尔玛", "蕾欧娜", "莫甘娜", "娜美", "诺提勒斯", "派克", "洛", "慎", "娑娜", "索拉卡",
           "塔姆", "锤石", "塔里克", "婕拉"]


def loadImage(url):
    img = cv2.cv2.imread(url)
    return img


def predict(path):
    dir_path = path
    try:
        image = Image.open(dir_path)
        height = image.height
        width = image.width
        port_area = (width * 0.25, height * 0.85, width * 0.40, height * 0.99)
        image = image.crop(port_area)
        image.save(dir_path)
        img = loadImage(dir_path)
        hero = match(img)
        # Initiate SIFA detector
        return hero
    except:
        return -1, 'notpic', '0', '0', '0'


def match(img):
    hsv = cv2.cvtColor(img, cv2.COLOR_BGR2HSV)
    lower_yellow = np.array([14, 34, 34])
    upper_yellow = np.array([32, 220, 220])
    mask = cv2.inRange(hsv, lower_yellow, upper_yellow)
    cimg = cv2.medianBlur(mask, 5)

    circles = cv2.HoughCircles(cimg, cv2.HOUGH_GRADIENT, 1, 100, param1=50, param2=20, minRadius=32, maxRadius=0)
    if circles is not None:
        big_circle = np.uint16(np.around(circles))[0][0]
        x_min = max(0, int(big_circle[0]) - int(big_circle[2]))
        x_max = min(big_circle[0] + big_circle[2], img.shape[1] - 1)
        y_min = max(0, int(big_circle[1]) - int(big_circle[2]))
        y_max = min(big_circle[1] + big_circle[2], img.shape[0] - 1)

        img = cv2.cvtColor(img, cv2.COLOR_BGR2GRAY)
        img = cv2.resize(img[y_min:y_max, x_min:x_max], (120, 120))
        return detect(img)
    else:
        return 0, 'unknown', '0', '0', '0'


img_surf_dict = {}


def detect(dest):
    if not img_surf_dict:
        hero_arr = np.load('/home/q/system/furion/py/lol_init_hero.npy')
        init_arr = np.load('/home/q/system/furion/py/lol_init_data.npy')
        # hero_arr = np.load('lol_init_hero.npy')
        # init_arr = np.load('lol_init_data.npy')
        for hero, surf in zip(hero_arr, init_arr):
            img_surf_dict[hero] = surf

    surf_creater = cv2.cv2.xfeatures2d.SURF_create()
    dest_surf = surf_creater.detectAndCompute(dest, None)

    # FLANN parameters
    FLANN_INDEX_KDTREE = 0
    index_params = dict(algorithm=FLANN_INDEX_KDTREE, trees=5)
    search_params = dict(checks=50)  # or pass empty dictionary
    flann = cv2.cv2.FlannBasedMatcher(index_params, search_params)

    img_good_dict = {}
    for img_name, img_surf in img_surf_dict.items():
        matches = flann.knnMatch(img_surf[1], dest_surf[1], k=2)
        good_dict = {}
        for m, n in matches:
            if m.distance < 0.7 * n.distance:
                good_dict[m.trainIdx] = m
        good = list(good_dict.values())
        img_good_dict[img_name] = good

    crd_dict = {}
    for img_name, img_good in sorted(img_good_dict.items(), key=lambda x: len(x[1]), reverse=True)[:5]:
        src_pts = np.float32([img_surf_dict[img_name][0][m.queryIdx] for m in img_good]).reshape(-1, 1, 2)
        dst_pts = np.float32([dest_surf[0][m.trainIdx].pt for m in img_good]).reshape(-1, 1, 2)
        M, mask = cv2.findHomography(src_pts, dst_pts, cv2.RANSAC, 0.8)
        mask = mask.ravel().tolist()
        crd_dict[img_name] = mask

    max_match = sorted(crd_dict.items(), key=lambda x: x[1].count(1), reverse=True)[0]
    max_name = max_match[0]
    # max_mask = max_match[1]
    max_good = img_good_dict[max_name]

    # draw_params = dict(matchColor=(0, 255, 0),  # draw matches in green color
    #                    singlePointColor=None,
    #                    matchesMask=max_mask,  # draw only inliers
    #                    flags=2)
    # img = cv2.imread(os.path.join('lol_avatar', max_name), 0)
    # img2 = cv2.drawMatches(img, img_surf_dict[max_name][0], dest, dest_surf[0], max_good, None, **draw_params)
    # cv2.imwrite(os.path.join('./lol_dest', max_name), img2)

    max_num = len(max_good)
    hero = max_name.split('-')[0]
    return max_num, hero, '1', '1', '1'


def saveImage(url):
    if not os.path.exists(os.getcwd() + '/lol_hero/'):
        os.mkdir(os.getcwd() + '/lol_hero/')
    file_md5 = hashlib.md5(url).hexdigest()
    file_path = os.getcwd() + '/lol_hero/' + file_md5 + '.jpg'
    urllib.urlretrieve(url, file_path)
    return file_path, file_md5


def getRole(hero):
    global top
    global adc
    global support
    global jungle
    global mid
    global hot
    if hero in top:
        return 'top'
    elif hero in adc:
        return 'adc'
    elif hero in support:
        return 'support'
    elif hero in jungle:
        return 'jungle'
    elif hero in mid:
        return 'mid'
    elif hero in hot:
        return 'hot'
    else:
        return 'unknown'


def detect_img(url):
    file_path, file_md5 = saveImage(url)
    # max,hero,ori,tar,good = predict(file_path)
    max, hero, ori, tar, good = predict(file_path)
    result = format_response(max, hero, ori, tar, good)
    result["data"]["md5"] = file_md5
    print(json.dumps(result))
    # return result


def format_response(max, hero, ori, tar, good):
    global hero_map
    result = {}
    if max < 0:
        result["errno"] = 401
        result["errmsg"] = "cannot read pic"
        result["data"] = {}
    elif max < 1:
        result["errno"] = 402
        result["errmsg"] = "detect failed"
        result["data"] = {}
    else:
        result["errno"] = 0
        result["errmsg"] = "success"
        result["data"] = {
            "heroKey": hero,
            "role": getRole(hero_map[hero]),
            "cnName": hero_map[hero],
            "ori": ori,
            "tar": tar[0],
            "good": good
        }
    return result

# url = 'http://i6.pdim.gs/89189e371b65fdbc8755dd7acf43dfb9.jpg'
# print detect_img(url)
